function gjfpy()



gjfpy={
------------速度地址偏移---------

  sddz,
  rwdz,
  mrrw,    ---原地任务>>> 210453397504;7521962645310668800;8389754676365911401;85899345920::最后一个偏移,    --1888✓  107,374,182,400;25D;4,294,967,296;1D::17从1D转找到有1~288D的1D地址
  ydrwddr,    --原地任务获取
  ydrwcd,   --原地任务修复 
  ydgypy ,    --原地光翼>>> ✓  :l_CandleSpace_0 往前两个
  julazuaddr,   --举蜡烛>>> ✓ CA内存
  yclzaddr ,    --隐藏蜡烛>>> ✓
  LightChipAddr ,   --吸光标>>> ✓
  csaddr ,    --任意门>>> ✓
  huazb ,   --花坐标>>> ✓  
  Azhahua ,  --炸花>>> ✓  
  dianhuo ,   --点蜡烛>>> ✓
  dtaddr ,   ---地图判断>> ✓   
  guangyiaddr ,  --吸光翼>>> ✓    
  friendship ,   --解锁友谊>>> ✓
  
  daoli ,   --人物倒立+遁地>>> ✓
  rwxzaddr ,--人物旋转
    zldz ,   --帧率地址
  hzdz ,  ---画质地址
  xjdiaoxiang,--独狼献祭>>> ✓   
  luzhiyx ,    --录制影像>>> ✓
  
  ---------------人物地址偏移--------
  --[[  ]]
dengjiaddr , --光翼数量>>> ✓
  hyxx ,  --好友信息>>> ✓  
  dz ,  --查询身高>>> ✓
  nengliang,  --无限能量>>> ✓
  zspy ,   ---坐姿  修

qzdz ,  --强制动作   
  bbdz, --背背  
   zf , --炸房>>>
wxyq ,  --氧气>>> ✓
rwysaddr, --人物隐身>>> ✓
mfdz , --魔法>>> ✓
fjrs,  ---房间人数>>> ✓
sxdz,  --刷新房间>>> ✓ 
yjxzaddra, --原地先祖a*** 
yjxzaddrb, --原地先祖b*** 
Address_clos, --自慰衣柜>>> ✓
zhayi , --炸翼 修
dpaddr, --无翼>>> ✓
yanhuadz,--烟花
mfkg, --魔法商店>>> ✓1019
mfkz, --商店控制
mfjh,    --mfkz+0x10

lazushuliang, --蜡烛数量>>> ✓ 
-------------- 独家偏移--------------
ltkb2, --xa窥屏1>>> ✓
ltkb3,  --xa窥屏2修>>> ✓
tkfraddr, --太空飞人>>> ✓
dxbaddr, --人物大小
xgjaddr, --香港脚>>> ✓
kzzladdr,  --控制重力>>> ✓
fmtaddr, --飞毛腿>>> ✓
ydygaddr,--原地衣柜>>> ✓ CA内存0or1

smlzaddr,--睡眠粒子>>> ✓10.19
--CA内存改D类型 1改257D  待找



------xa偏移-------

fasthome, --B.LT [PC,#0x194]这个为Armx64的改成[[NOP]]  D类1409289387改-721215457 xxxx
xadlz, --xa点蜡烛'-721215457 D', '872415464 D' 10.19
fengqiang,  --xa风墙505873376D', '1847778369D' xxxx
xayanhua,  --xa无限烟花1895525739，1895826762D xxxx
unemote ,  --全动作-1186976888改1384120352d xxxx
uncloset ,--全衣柜446629856改1384120352d 10.19 可隐形斗
unnodes ,   --好友树872415336改1384120352d 10.19
rclouds , --1改0d xxxx
rwater ,  --506204171改505581568d xxxx
rportals ,  ---传送端口移除872415464改成1384120352d xxxx
 realisim , ----真实画质872417320改1384120352D xxxx
pspeed ,   ---跑步速度3.5F改想要的 xxxxxx
pjump ,  ---跳远距离505964577改505581568d xxxxx
pdive ,   --游泳速度-1118854912改505712640d xxxx
pdelay ,   -- 残影872416009改 1384120352d 10.19
 plain ,  --飞机模式872415402改1384120352d xxxx
scooter , ---滑板鞋1847647232改506892288d xxxx
spfly ,   --- 超级起飞506761216 D', '520725538 D' xxxx
wcharge ,---能量充能505571328改505745408d   10.19
xamap ,   ---xa地图 xxxxx
bejaddr, ---白耳机变红黑小人 10.19
--特征码-5,111,943,334,450,494,496 XA内存搜Q类型 本地址 改505712640D
qygdz,   ----全衣柜>>> ✓
--特征码1,918,260,628,980,498,463A;-6,250,578,480,809,965,600A;-6,286,374,217,625,535,491A:9 XA内存搜Q类型 改B类型 第一个-6,286,374,217,625,535,491地址偏移-1 26B改82B
wxhxaddr,  ---无限滑行>>> ✓
--特征码2,175,071,919,960,363,013 XA Q类型 本地址 改505925632D
wshsaddr,  ---无视海水>>> ✓
--特征码2,172,709,610,637,574,144 XA Q类型 本地址 改506630144D
-------------------------
}

gjfpymz={
------------速度地址偏移---------

  "sddz",
  "rwdz",
  "mrrw"   ,  ---原地任务>>> 210453397504;7521962645310668800;8389754676365911401;85899345920::最后一个偏移"   ,    --1888✓  107,374,182,400;25D;4,294,967,296;1D::17从1D转找到有1~288D的1D地址
  "ydrwddr"   , ---原地任务获取
  "ydrwcd"   ,  ----原地任务修复 
  "ydgypy "   ,   ----原地光翼>>> ✓  :l_CandleSpace_0 往前两个
  "julazuaddr"   , ---举蜡烛>>> ✓ CA内存
  "yclzaddr "   ,  ---隐藏蜡烛>>> ✓
  "LightChipAddr "   , ---吸光标>>> ✓
  "csaddr "   ,    ---任意门>>> ✓
  "huazb "   ,    --花坐标>>> ✓  
  "Azhahua "   ,  --炸花>>> ✓  
  "dianhuo "   ,  ---点蜡烛>>> ✓
  "dtaddr "   ,    ----地图判断>> ✓   
  "guangyiaddr "   ,   ---吸光翼>>> ✓    
  "friendship "   ,  ---解锁友谊>>> ✓
  
  "daoli "   ,   ---人物倒立+遁地>>> ✓
  "rwxzaddr "   ,  ---人物旋转
    "zldz "   ,   ---帧率地址
  "hzdz "   ,   ----画质地址
  "xjdiaoxiang"   , ---独狼献祭>>> ✓   
  "luzhiyx "   ,    ---录制影像>>> ✓
  
  ---------------人物地址偏移--------
  --[[  ]]
"dengjiaddr "   ,  ---光翼数量>>> ✓
  "hyxx "   ,  ---好友信息>>> ✓  
  "dz "   , ---查询身高>>> ✓
  "nengliang"   , ---无限能量>>> ✓
  "zspy "   ,   ---坐姿  修

"qzdz "   ,  ---强制动作   
  "bbdz"   ,   ---背背  
   "zf "   ,    ----炸房>>>
"wxyq "   ,    --氧气>>> ✓
"rwysaddr"   ,   --人物隐身>>> ✓
"mfdz "   ,    ---魔法>>> ✓
"fjrs"   ,    ---房间人数>>> ✓
"sxdz"   ,    ----刷新房间>>> ✓ 
"yjxzaddra"   ,    ----原地先祖a*** 
"yjxzaddrb"   ,    ---原地先祖b*** 
"Address_clos"   ,   ---自慰衣柜>>> ✓
"zhayi "   ,    ----炸翼 修
"dpaddr"   ,    -----无翼>>> ✓
"yanhuadz"   ,    ----烟花
"mfkg"   ,    ----魔法商店>>> ✓1019
"mfkz"   ,    ----商店控制
"mfjh"   ,    --mfkz+0x10

"lazushuliang"   ,    ----蜡烛数量>>> ✓ 
-------------- 独家偏移--------------
"ltkb2"   ,    ----xa窥屏1>>> ✓
"ltkb3"   ,    -----xa窥屏2修>>> ✓
"tkfraddr"   ,    ---太空飞人>>> ✓
"dxbaddr"   ,    -----人物大小
"xgjaddr"   ,    ----香港脚>>> ✓
"kzzladdr"   ,    -----控制重力>>> ✓
"fmtaddr"   ,    -----飞毛腿>>> ✓
"ydygaddr"   ,    --原地衣柜>>> ✓ CA内存0or1

"smlzaddr"   ,    -----睡眠粒子>>> ✓10.19
--CA内存改D类型 1改257D  待找



------xa偏移-------

"fasthome"   ,    -----B.LT [PC,#0x194]这个为Armx64的改成[[NOP]]  D类1409289387改-721215457 xxxx
"xadlz"   ,    ----xa点蜡烛'-721215457 D', '872415464 D' 10.19
"fengqiang"   ,    ----xa风墙505873376D', '1847778369D' xxxx
"xayanhua"   ,    ----xa无限烟花1895525739，1895826762D xxxx
"unemote "   ,    ----全动作-1186976888改1384120352d xxxx
"uncloset "   ,    ----全衣柜446629856改1384120352d 10.19 可隐形斗
"unnodes "   ,    ----好友树872415336改1384120352d 10.19
"rclouds "   ,    ----1改0d xxxx
"rwater "   ,    ----506204171改505581568d xxxx
"rportals "   ,    ----传送端口移除872415464改成1384120352d xxxx
 "realisim "   ,    ----真实画质872417320改1384120352D xxxx
"pspeed "   ,    ----跑步速度3.5F改想要的 xxxxxx
"pjump "   ,    ----跳远距离505964577改505581568d xxxxx
"pdive "   ,    ----游泳速度-1118854912改505712640d xxxx
"pdelay "   ,    ---- 残影872416009改 1384120352d 10.19
 "plain "   ,    ---飞机模式872415402改1384120352d xxxx
"scooter "   ,    ---滑板鞋1847647232改506892288d xxxx
"spfly "   ,    ---- 超级起飞506761216 D', '520725538 D' xxxx
"wcharge "   ,    -----能量充能505571328改505745408d   10.19
"xamap "   ,    -----xa地图 xxxxx
"bejaddr"   ,    -----白耳机变红黑小人 10.19
--特征码-5,111,943,334,450,494,496 XA内存搜Q类型 本地址 改505712640D
"qygdz"   ,    ----全衣柜>>> ✓
--特征码1,918,260,628,980,498,463A;-6,250,578,480,809,965,600A;-6,286,374,217,625,535,491A:9 XA内存搜Q类型 改B类型 第一个-6,286,374,217,625,535,491地址偏移-1 26B改82B
"wxhxaddr"   ,    ---无限滑行>>> ✓
--特征码2,175,071,919,960,363,013 XA Q类型 本地址 改505925632D
"wshsaddr"   ,    ----无视海水>>> ✓
--特征码2,172,709,610,637,574,144 XA Q类型 本地址 改506630144D
-------------------------
}
  Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
  Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
for i=1,#gjfpy do

ct = {
        {
            address = gjfpy[i],
            flags = 4,
            name = gjfpymz[i],
        },

        }
        gg.addListItems(ct)
end
end
function mryj()--任务
  Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
    jiasu(10)  gg.sleep(800)  ydrw()  ydpt() ydzx()  gg.sleep(800) Teleport({1.2416000366211;0.20657592773438;6.118523025512695})
     jiasu(3)
      gg.sleep(5000) Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
      Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
      Teleport({1.2416000366211;0.20657592773438;6.118523025512695}) 
      gg.sleep(10000)
      Teleport({0;1;0}) 
     end
function yjnv()--活动
jiasu(10)  qt(1) gg.sleep(800) Teleport({17.482812881469727;0.945996105670929;-44.410072326660156})

 jiasu(3) gg.sleep(5000) 
 gg.sleep(500) 
 gg.sleep(500) 
Teleport({17.482812881469727;0.945996105670929;-44.410072326660156})
xaqyg()
end
