function mhj()
local gdCountm = 0
mha = {}
mha[1]={-16.106786727905273;28.03017234802246;5.269355773925781}
mha[2]={24.077102661132812;21.764562606811523;1.8075374364852905}
mha[3]={13.28267765045166;46.848567962646484;-5.044236183166504}
mha[4]={-15.228153228759766;39.478614807128906;6.27426290512085}

season16a = {}  --老兵

season16a[1]={-16.106786727905273;28.03017234802246;5.269355773925781}  --位置
season16a[2]={-41.61516571044922;21.770532608032227;14.183392524719238}
season16a[3]={-66.19331359863281;26.124773025512695;-1.9038877487182617}
season16a[4]={-87.71868133544922;30.066883087158203;7.118488788604736}
season16a[5]={-105.5757827758789;27.662429809570312;18.442785263061523}
season16a[6]={-103.17876434326172;25.48596954345703;-8.177335739135742}
season16a[7]={-83.19065856933594;30.07098388671875;6.2537336349487305}
season16a[8]={-64.82360076904297;26.121864318847656;-0.22579212486743927}
season16a[9]={-42.052146911621094;21.77046775817871;13.491498947143555}
season16a[10]={-21.004215240478516;24.87603759765625;15.854981422424316}

season16b = {}  --
season16b[1]={24.077102661132812;21.764562606811523;1.8075374364852905}
season16b[2]={37.80436325073242;21.205408096313477;-11.283628463745117}
season16b[3]={59.520164489746094;21.81255531311035;-21.88716697692871}
season16b[4]={79.59500885009766;26.325944900512695;-14.575606346130371}
season16b[5]={90.58992767333984;22.531644821166992;5.561466693878174}
season16b[6]={79.95419311523438;25.18382453918457;29.249509811401367}
season16b[7]={62.683349609375;21.67848777770996;30.774051666259766}
season16b[8]={40.51034927368164;23.86395263671875;22.491493225097656}
season16b[9]={37.47064208984375;23.862829208374023;17.98189926147461}


season16c = {}  --
season16c[1]={13.28267765045166;46.848567962646484;-5.044236183166504}
season16c[1]={29.19168472290039;45.06907272338867;-10.954597473144531}
season16c[1]={54.19334411621094;48.37731170654297;-11.60615348815918}
season16c[1]={60.55010223388672;46.85041046142578;16.43609619140625}
season16c[1]={38.44904327392578;45.27870559692383;27.62895393371582}
season16c[1]={32.952369689941406;45.277462005615234;27.34131622314453}
season16c[1]={12.454748153686523;45.96070098876953;6.404411315917969}



season16d = {}  --
season16d[1]={-15.228153228759766;39.478614807128906;6.27426290512085}
season16d[1]={-35.93367004394531;39.039588928222656;-6.53223991394043}
season16d[1]={-44.33541488647461;39.043270111083984;-5.211798667907715}
season16d[1]={-52.62186050415039;39.04093551635742;-6.225323677062988}
season16d[1]={-78.22079467773438;44.173423767089844;-3.453080654144287}
season16d[1]={-96.62284088134766;40.921749114990234;11.626667976379395}
season16d[1]={-79.92951202392578;44.17289733886719;-3.158977508544922}
season16d[1]={-39.051334381103516;39.04110336303711;-6.407262325286865}
season16d[1]={-44.474632263183594;39.043033599853516;-6.002659797668457}
season16d[1]={-39.633544921875;39.041526794433594;-6.216756820678711}
season16d[1]={-16.30271339416504;39.480857849121094;8.544486999511719}



--重置瞬移先祖--
--晨岛
local map8 = {}
local gdCount1 = 0
--晨岛先祖坐标
map8[1] = {}

map8[1][1] = {64.80686187744, 5.14548635483, 105.91326141357}
sky1 = {}
sky1[1] = {58.94992446899, 4.9788980484, 105.34553527832}
sky1[2] = {52.27404785156, 5.26914596558, 110.12825775146}
sky1[3] = {58.68653869629, 5.12043046951, 117.55633544922}
sky1[4] = {74.07012939453, 4.994556427, 113.85317993164}

map8[1][2] = {105.90128326416, 4.79724311829, 48.25633621216}
sky2 = {}
sky2[1] = {123.72571563721, 3.13738846779, 50.13516998291}
sky2[2] = {142.83909606934, 3.05479025841, 65.64388275146}
sky2[3] = {155.05934143066, 5.91439962387, 115.99460601807}
sky2[4] = {101.79879760742, 4.12522029877, 109.09219360352}
sky2[5] = {100.42581176758, 8.46671485901, 99.98972320557}

map8[1][3] = {136.74867248535,90.44455718994,-257.50369262695}
sky3 = {}
sky3[1] = {143.34887695312,87.10228729248,-248.04257202148}
sky3[2] = {149.08660666672,85.92551422119,-238.34835815430}
sky3[3] = {150.40620422363,86.79633331299,-237.38656616211}
sky3[4] = {155.54014587402,86.65998840332,-252.17694091797}

map8[1][4] = {155.8,103.51,-293.6}--终点

--云野
local map9 = {}
local gdCount2 = 0
--云野先祖坐标
map9[1] = {}
map9[1][1] = {101.26465606689,154.88084411621,17.43948364258}
yy1 = {}
yy1[1] = {116.690376,157.202316,31.787988}
yy1[2] = {109.515472,156.458953,26.809562}
yy1[3] = {103.318199,157.648086,32.537815}
yy1[4] = {111.582458,156.433929,26.943059}

map9[1][2] = {-192.66337585449,193.75396728516,83.59469604492}
yy2 = {}
yy2[1] = {-196.515396,197.847717,83.379333}
yy2[2] = {-195.564147,201.169876,89.166801}
yy2[3] = {-197.085662,205.779479,86.774139}

map9[1][3] = {110.48519897461,181.2214050293,250.57133483887}--左洞
yy3 = {}
yy3[1] = {100.664253,181.754409,245.520782}
yy3[2] = {86.707382,181.746459,238.079406}
yy3[3] = {76.545852,183.895370,255.600067}
yy3[4] = {99.624191,194.186859,250.073211}
yy3[5] = {89.558723,198.815826,270.571197}
yy3[5] = {91.750251,198.899627,273.685913}

map9[1][4] = {75.58396911621,184.34452819824,331.81048583984}--中
yy4 = {}
yy4[1] = {82.888336,188.670532,348.228973}
yy4[2] = {73.112548,194.198120,361.487304}
yy4[3] = {68.559768,198.262191,364.054840}

map9[1][5] = {60.022,185.073,365.05}--中洞
yy5 = {}
yy5[1] = {59.121768,185.218978,369.634613}
yy5[2] = {61.540992,185.218994,362.703582}
yy5[3] = {64.963043,185.217910,368.503173}
yy5[4] = {60.266231,185.222518,363.422515}

map9[1][6] = {-40.42894744873,183.27674865723,313.63589477539}--右洞
yy6 = {}
yy6[1] = {-29.232383,184.302627,308.347259}
yy6[2] = {-10.224791,186.336883,302.565216}
yy6[3] = {-9.936346,190.160354,311.797393}
yy6[4] = {-15.466066,192.646286,314.935302}

map9[1][7] = {315.27615356445,188.25726318359,210.62249755859}
yy7 = {}
yy7[1] = {327.696746,189.622711,216.531723}
yy7[2] = {340.582946,184.100936,228.907821}
yy7[3] = {368.022705,181.046554,231.221694}
yy7[4] = {395.420959,180.849105,209.517242}
yy7[5] = {413.294433,187.036023,209.076461}

--雨林
local map10 = {}
local gdCount3 = 0
--雨林先祖坐标
map10[1] = {}
map10[1][1] = {30.70751953125,97.58390808105,-179.40824890137}
yl1 = {}
yl1[1] = {16.93806076049,96.87742614746,-177.86671447753}
yl1[2] = {16.11702919006,96.39558410644,-166.99340820312}
yl1[3] = {9.99261760711,97.99803161621,-156.71223449707}
yl1[4] = {14.20316410064,99.33074951171,-145.80369567871}
yl1[5] = {17.98043251037,99.12267303466,-135.02557373046}

map10[1][2] = {69.49216461182,106.90505218506,-87.62112426758}
yl2 = {}
yl2[1] = {67.88175964355,106.59674072265,-80.70234680175}
yl2[2] = {68.98313140869,107.43225860595,-65.15387725830}
yl2[3] = {75.27891540527,107.67600250244,-61.29362106323}
yl2[4] = {85.76490020751,109.29707336425,-59.33642959594}
yl2[5] = {107.66295623779,112.14456939697,-48.08292007446}
yl2[6] = {109.80916595458,112.09865570068,-45.51247024536}

map10[1][3] = {85.16683959961,102.52812194824,12.71730327606}
yl3 = {}
yl3[1] = {95.89743804931,102.07133483886,22.54758834838}
yl3[2] = {93.12996673583,99.38754272460,31.49808120727}
yl3[3] = {89.07014465332,98.64786529541,34.67620468139}
yl3[4] = {78.27222442626,96.64196014404,34.59815597534}

map10[1][4] = {36.74116134644,96.14245605469,-14.23884391785}
yl4 = {}
yl4[1] = {47.65795516967,95.99945068359,-3.24182915687}
yl4[2] = {69.49405670166,96.84957122802,-8.42848491668}
yl4[3] = {60.15018463134,100.53179931640,0.42734500765}
yl4[4] = {41.13249588012,104.54130554199,12.04802703857}
yl4[5] = {39.14956283569,113.32818603515,31.33630943298}

map10[1][5] = {22.09764480591,139.74815368652,5.68258905411}
yl5 = {}
yl5[1] = {22.583560,140.200942,17.890031}
yl5[2] = {24.686170,140.396538,43.650920}
yl5[3] = {10.864163,139.687301,71.751564}
yl5[4] = {3.030520,139.422988,77.747024}

map10[1][6] = {57.04404449463,143.89994812012,50.25771331787}
yl6 = {}
yl6[1] = {54.01134872436,145.84671020507,57.43698501586}
yl6[2] = {52.16764450073,145.66212463378,53.17017745971}
yl6[3] = {47.91177749633,145.82371520996,52.30420684814}
yl6[4] = {44.65831756591,145.97845458984,56.06175231933}
yl6[5] = {35.98408889770,144.35447692871,75.76773071289}

map10[1][7] = {-82.67083740234,134.6703338623,223.05491638184}
yl7 = {}
yl7[1] = {-82.97026824951,134.56648254394,214.90242004394}
yl7[2] = {-72.03417968750,134.50639343261,223.40002441406}
yl7[3] = {-80.37356567382,135.00367736816,230.83522033691}
yl7[4] = {-83.63902282714,134.94985961914,222.74227905273}
yl7[5] = {-91.27504730224,136.24087524414,225.23333740234}




--霞谷
local map11 = {}
local gdCount4 = 0
--霞谷先祖坐标
map11[1] = {}
map11[1][1] = {168.41310119629,67.07646179199,-448.99984741211}
xg1 = {}
xg1[1] = {162.29786682128,68.21259307861,-460.57196044921}
xg1[2] = {151.55928039550,74.63336181640,-453.57031250000}
xg1[3] = {160.99491882324,76.86156463623,-442.72457885742}
xg1[4] = {169.89755249023,76.13133239746,-443.52767944335}

map11[1][2] = {59.75024032593,490.71014404297,32.25593185425}
xg2 = {}
xg2[1] = {44.47880172729,497.68740844726,30.94039344787}
xg2[2] = {27.89121627807,496.56979370117,13.94200420379}
xg2[3] = {26.78898239135,515.40136718750,-32.05183029174}
xg2[4] = {30.08931350708,530.58831787109,-43.48488235473}
xg2[5] = {71.61949157714,540.99975585937,-56.68285751342}
xg2[6] = {96.36257171630,530.67492675781,-47.00332260131}

map11[1][3] = {120.34407043457031;473.7091979980469;6.506269931793213}
xg3 = {}
--这个坐标本事大的来抓，手动滑稽--

map11[1][4] = {90.54080200195,154.20066833496,-171.37298583984}
xg4 = {}
xg4[1] = {116.64083862304,161.52305603027,-187.35650634765}
xg4[2] = {118.86928558349,154.48075866699,-215.05931091308}


--暮土
local map12 = {}
local gdCount5 = 0
--暮土先祖坐标
map12[1] = {}
map12[1][1] = {-33.87367630005,0.47998189926,388.09027099609}
mt1 = {}
mt1[1] = {-47.22530746459,10.94340801239,352.86129760742}
mt1[2] = {-96.65264129638,1.64559519290,325.35794067382}
mt1[3] = {-97.98181152343,1.41314244270,328.38919067382}

map12[1][2] = {-21.26772689819,7.72060775757,262.90121459961}
mt2 = {}
mt2[1] = {-31.89016532897,2.02924919128,245.10450744628}
mt2[2] = {-27.447704,0.392863,230.614608}
mt2[3] = {-18.65313339233,1.50483536720,219.92141723632}
mt2[4] = {-21.32256698608,0.96985554695,207.28706359863}
mt2[5] = {-20.41801452636,1.67349839210,202.90527343750}


map12[1][3] = {62.99663543701,92.83907318115,261.21282958984}
mt3 = {}
mt3[1] = {44.69726562500,91.15282440185,237.41056823730}
mt3[2] = {47.80560684204,89.81167602539,218.16560363769}
mt3[3] = {52.00352478027,89.71234893798,207.11741638183}
mt3[4] = {58.70776748657,92.12214660644,195.47552490234}
mt3[5] = {60.31597518920,95.37597656250,189.33790588378}
mt3[6] = {62.36653518676,99.01262664794,182.48326110839}
mt3[7] = {68.34260559082,99.15675354003,145.23588562011}

map12[1][4] = {-1.81847178936,67.47225952148,-109.97587585449}
mt4 = {}
mt4[1] = {2.84740447998,67.87450408935,-103.85334777832}
mt4[2] = {14.91339015960,74.69053649902,-119.12010955810}
mt4[3] = {8.08583927154,77.06929779052,-131.68843078613}
mt4[4] = {7.34354209899,77.32836151123,-140.53572082519}

map12[1][5] = {-209.48788452148,1.04883360863,398.78448486328}
mt5 = {}
mt5[1] = {-202.07702636718,1.89386856555,407.66906738281}
mt5[2] = {-195.90753173823,2.12663841247,416.18969726562}
mt5[3] = {-189.76255798339,7.80643558502,403.20794677734}
mt5[4] = {-196.32501220703,10.83698844909,396.54525756835}
mt5[5] = {-181.55036926269,12.03136539459,373.74008178710}
mt5[6] = {-171.77412414550,10.85400676727,373.55349731445}

map12[1][6] = {-231.60386657715,102.21933746338,-191.23571777344}
mt6 = {}
mt6[1] = {-233.08888244628,114.49264526367,-182.36700439453}
mt6[2] = {-241.99330139160,110.08288574218,-182.69525146484}
mt6[3] = {-251.88490295410,115.97129821777,-170.98771667480}
mt6[4] = {-224.69233703613,128.43896484375,-159.30917358398}
mt6[5] = {-213.85812377929,137.02476501464,-165.24546813964}
mt6[6] = {-212.57273864746,148.3724822998,-162.73057556152}

--禁阁
local map13 = {}
local gdCount6 = 0
--禁阁先祖坐标
map13[1] = {}
map13[1][1] = {-62.09304428101,40.73058319092,22.32921409607}
jg1 = {}
jg1[1] = {-67.93663024902,40.38966369628,34.35494995117}
jg1[2] = {-72.54860687255,40.38965225219,16.60508918762}
jg1[3] = {-66.14085388183,40.38965988159,12.25107860565}
jg1[4] = {-49.02717208862,43.64829254150,16.92056274414}
jg1[5] = {-56.54952239990,49.66357040405,31.19394874572}
jg1[6] = {-64.29154968261,50.21882629394,31.95277023315}

map13[1][2] = {47.82119369507,83.53661346436,42.63860702515}
jg2 = {}
jg2[1] = {35.30688095082,82.84276580810,47.41799545288}
jg2[2] = {27.39916038513,83.75881958007,56.86069107055}
jg2[3] = {28.87890052795,82.82781982421,39.90015029907}
jg2[4] = {21.24525451660,82.84236145019,44.06553649902}

map13[1][3] = {-37.25931549072,143.38360595703,-22.54124641418}
jg3 = {}
jg3[1] = {-18.95537757873,146.77537536621,-29.63357925415}
jg3[2] = {-3.594398021697,146.94731140136,-32.64868164062}
jg3[3] = {26.130910873413,152.24751281738,-37.39312362670}
jg3[4] = {31.476238250732,153.90464782714,-42.26019287109}

--map13[1][4] = {48.09609985352;228.29138183594;8.88393878937}

map13[1][4] = {-11.23779010773,149.86012268066,-44.61698913574}
jg4 = {}
jg4[1] = {-19.87369537353,151.37120056152,-45.45783233642}
jg4[2] = {-16.95526885986,157.81134033203,-55.83851623535}
jg4[3] = {-13.58221244812,164.15745544433,-49.86547470092}

map13[1][5] = {-0.35613438487;303.56619262695;58.07741546631}

end

mhj()
function syxz()
	
  menu = gg.choice({
  "1. 晨岛",
  "2. 云野",
  "3. 雨林",
  "4. 霞谷",
  "5. 暮土",
  "6. 禁阁",
  "7. 缅怀",
  "0. 返回上一页"
 }, nil, "先祖重置瞬移")
  if menu == 1 then sycdxz() end
  if menu == 2 then syyyxz() end
  if menu == 3 then syylxz() end
  if menu == 4 then syxgxz() end
  if menu == 5 then symtxz() end
  if menu == 6 then syjgxz() end
  if menu == 7 then symhxz() end
  if menu == 8 then Main() end
end

--晨岛
function symhxz()
	jiasu(2)
  menu1 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "缅怀 - 瞬移")
  if menu1 == nil then else
  if menu1[1] == true then mhl1() end
  if menu1[2] == true then syxz() end end
end

local map8_in = 0
local map8_temple_in = 0 --缅怀入口

--缅怀先祖[下一个]
function mhl1()
	if gdCountm == 0 and map8_in ~= 1 then
		
		gg.toast("先祖重置完成，1秒后瞬移至晨岛入口")
		gg.sleep(1000)
		Teleport({-16.106786727905273;28.03017234802246;5.269355773925781})
		gg.toast("瞬移晨岛入口完成，进入后请继续冲！")
		map8_in = 1
		return 0
	end
	
	if gdCountm == 3 then
		gg.toast("请手动返回遇境")
	else
		gdCountm = gdCountm + 1
		xyz = mha[gdCountm]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(3000)
		if gdCountm ==1 then
			for i = 1, #season16a do
				gg.sleep(2000)
				Teleport(season16a[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCountm ==2 then
			for i = 1, #season16b do
				gg.sleep(2000)
				Teleport(season16b[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCountm ==3 then
			for i = 1, #season16c do
				gg.sleep(2000)
				Teleport(season16c[i])
			end
			gg.toast("已结束")
			gg.sleep(12000)
			
			gg.toast("请务必冥想谢谢！")
		end
		if gdCountm ==4 then
			for i = 1, #season16d do
				gg.sleep(2000)
				Teleport(season16d[i])
			end
			gg.toast("已结束")
			gg.sleep(12000)
			
			
		end
	end
end




--晨岛
function sycdxz()
	jiasu(2)
  menu1 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "晨岛 - 瞬移")
  if menu1 == nil then else
  if menu1[1] == true then l1() end
  if menu1[2] == true then L() end end
end

local map8_in = 0
local map8_temple_in = 0 --神庙入口

--晨岛先祖[下一个]
function l1()
	if gdCount1 == 0 and map8_in ~= 1 then
		cdcz()
		gg.toast("先祖重置完成，1秒后瞬移至晨岛入口")
		gg.sleep(1000)
		Teleport({11.265,1.5,1.02})
		gg.toast("瞬移晨岛入口完成，进入后请继续冲！")
		map8_in = 1
		return 0
	end
	
	if gdCount1 == 3 then
		gg.toast("请手动返回遇境")
	else
		gdCount1 = gdCount1 + 1
		xyz = map8[1][gdCount1]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(3000)
		if gdCount1 ==1 then
			for i = 1, #sky1 do
				gg.sleep(2000)
				Teleport(sky1[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount1 ==2 then
			for i = 1, #sky2 do
				gg.sleep(2000)
				Teleport(sky2[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount1 ==3 then
			for i = 1, #sky3 do
				gg.sleep(2000)
				Teleport(sky3[i])
			end
			gg.toast("这个先祖已结束，10秒后自动去终点！")
			gg.sleep(12000)
			Teleport({156.066879,103.757659,-295.490875})
			gg.toast("请务必冥想谢谢！")
		end
		
	end
end

function cdcz()
	ll1()
	ll2()
	ll3()
end

function ll1()
	setClear("414084241")
end

function ll2()
	setClear("3666569351")
end

function ll3()
	setClear("4249009249")
end


local map9_in = 0 
local map9_right_in = 0 --右侧隐藏图入口
local map9_right_out = 0 --右侧隐藏图出口
local map9_left_in = 0 --左侧隐藏图入口
local map9_left_out = 0 --左侧隐藏图出口
local map9_temple_in = 0 --神庙入口
--云野
function syyyxz()
  menu2 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "云野 - 瞬移")
  if menu2 == nil then else
  if menu2[1] == true then l2() end
  if menu2[2] == true then L() end end
end

--云野先祖[下一个]
function l2()
	if gdCount2 == 0 and map9_in ~= 1 then
		l21()
		gg.toast("先祖重置完成，1秒后瞬移至云野入口")
		gg.sleep(1000)
		Teleport({8.9,1.5,4.48})
		gg.toast("瞬移云野入口完成，请手动进入")
		map9_in = 1
		return 0
	end
	
	if gdCount2 == 8 then
		gg.toast("请手动返回遇境")
	else
		gdCount2 = gdCount2 + 1
		if gdCount2 == 2 and map9_right_in ~= 1 then
			l22()
			Teleport({-9.7918510437;165.37245178223;-5.74012947083})
			gg.toast("已瞬移至 [云野右侧隐藏图入口] ，请手动进入继续冲")
			gdCount2 = gdCount2 - 1
			map9_right_in = 1
			return 0
		end
		if gdCount2 == 3 and map9_right_out ~= 1 then
			l23()
		    l24()
			l25()
			l26()
			Teleport({-104.2032699585;184.77220153809;172.62110900879})
			gg.toast("已瞬移至 [云野右侧隐藏图出口] ，请手动进入继续冲")
			gdCount2 = gdCount2 - 1
			map9_right_out = 1
			return 0
		end
		if gdCount2 == 7 and map9_left_in ~= 1 then
			l28()
			Teleport({157.29043579102;200.01664733887;226.44515991211})
			gg.toast("已瞬移至 [云野左侧隐藏图入口] ，请手动进入")
			gdCount2 = gdCount2 - 1
			map9_left_in = 1
			return 0
		end
		
		if gdCount2 == 8 and map9_left_out ~= 1 then
		  Teleport({242.77,198.38,226})
		  gg.toast("已瞬移至 [云野左侧隐藏图出口] ，请手动进入，5秒后将自动瞬移")
		  map9_left_out = 1
		  gg.sleep(5000)
		  Teleport({127.50,254.79,479.60})
		  gg.toast("已瞬移至 [云野神庙入口] ，请手动进入，10秒后将自动瞬移")
		  map9_temple_in = 1
		  gg.sleep(10000)
		  Teleport({-112.18,89.54,42.43})
		  gg.toast("请务必冥想谢谢！")
		  return 0
		end
		xyz = map9[1][gdCount2]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(3000)
		
		
		if gdCount2 ==1 then
			for i = 1, #yy1 do
				gg.sleep(3000)
				Teleport(yy1[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount2 ==2 then
			for i = 1, #yy2 do
				gg.sleep(3000)
				Teleport(yy2[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount2 ==3 then
			for i = 1, #yy3 do
				gg.sleep(3000)
				Teleport(yy3[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount2 ==4 then
			for i = 1, #yy4 do
				gg.sleep(3000)
				Teleport(yy4[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount2 ==5 then
			--for i = 1, #yy5 do
			--	gg.sleep(3500)
			--	Teleport(yy5[i])
			--end
			gg.toast("自己冲吧！")
		end
		
		if gdCount2 ==6 then
			for i = 1, #yy6 do
				gg.sleep(3900)
				Teleport(yy6[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount2 ==7 then
			for i = 1, #yy7 do
				gg.sleep(3000)
				Teleport(yy7[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
	end
end

function l21()
	setClear("64338276")
end

function l22()
	setClear("2540775602")
end

function l23()
	setClear("1466879858")
end

function l24()
	setClear("1060667581")
end

function l25()
	setClear("2851084244")
end

function l26()
	setClear("3063270590")
end

function l27()
	setClear("1568825369")
end

function l28()
	setClear("3881128326")
end

local map10_in = 0 
local map10_main1 = 0 --主地图入口1
local map10_main2 = 0 --主地图入口2
local map10_main3 = 0 --神庙入口
--雨林
function syylxz()
  jiasu(2)
  menu3 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "雨林 - 瞬移")
  if menu3 == nil then else
  if menu3[1] == true then l3() end
  if menu3[2] == true then L() end end
end

--雨林先祖[下一个]
function l3()
	if gdCount3 == 0 and map10_in ~=1 then
		l31()
		gg.toast("重置先祖完成，1秒后瞬移至雨林入口")
		gg.sleep(1000)
		Teleport({5.04,1.5,7.505})
		gg.toast("已瞬移至 [雨林入口] ，请手动进入")
		gg.sleep(3000)
		l31()
		map10_in = 1
		return 0
    end

	if gdCount3 == 8 then
		gg.toast("请手动返回遇境")
	else
		gdCount3 = gdCount3 + 1
		if gdCount3 == 2 and map10_main1 ~=1 then
			l32()
			l33()
			l34()
			Teleport({28.37304496765;98.56972503662;-113.70115661621})
			gg.toast("已瞬移至 [雨林主地图入口1] ，请手动进入后继续冲")
			gdCount3 = gdCount3 - 1
			map10_main1 = 1
			return 0
		end
		if gdCount3 == 5 and map10_main2 ~=1 then
			l35()
			l36()
			l37()
			l38()
			Teleport({66.04258728027,99.53592681885,49.7889175415})
			gg.toast("已瞬移至 [雨林主地图入口2] ，请手动进入后继续冲")
			gdCount3 = gdCount3 - 1
			map10_main2 = 1
			return 0
		end
		if gdCount3 == 8 and map10_main3 ~=1 then
		  Teleport({-18.17,182.76,402.43})
		  gg.toast("已瞬移至 [雨林神庙入口] ，请手动进入，5秒后将自动瞬移")
		  map10_main3 = 1
		  gg.sleep(5000)
		  Teleport({-0.264,115.535,-4.0982})
		  gg.toast("请务必冥想谢谢！")
		  return 0
		end
		xyz = map10[1][gdCount3]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(3)
		gg.sleep(3000)
		
		if gdCount3 ==1 then
			for i = 1, #yl1 do
				gg.sleep(1500)
				Teleport(yl1[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount3 ==2 then
			for i = 1, #yl2 do
				gg.sleep(3000)
				Teleport(yl2[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount3 ==3 then
			for i = 1, #yl3 do
				gg.sleep(1500)
				Teleport(yl3[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount3 ==4 then
			for i = 1, #yl4 do
				gg.sleep(5000)
				Teleport(yl4[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount3 ==5 then
			for i = 1, #yl5 do
				gg.sleep(2500)
				Teleport(yl5[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		if gdCount3 ==6 then
			for i = 1, #yl6 do
				gg.sleep(3000)
				Teleport(yl6[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount3 ==7 then
			gg.toast("需要烧花自动动！")
		end
	end
end


function l31()
	setClear("3930381583")
end

function l32()
	setClear("3576552037")
end

function l33()
	setClear("1464190897")
end

function l34()
	setClear("2381086145")
end

function l35()
	setClear("419578801")
end

function l36()
	setClear("1156673674")
end

function l37()
	setClear("1728053750")
end

function l38()
	setClear("4182042971")
end


local map11_in = 0 
local map11_sky1_in = 0 --天空赛道一图入口
local map11_sky1_out = 0 --天空赛道一图出口
local map11_sky2_in = 0 --天空赛道二图入口
local map11_temple_in = 0 --神庙入口
--霞谷
function syxgxz()
  jiasu(2)
  G4 = 1
  menu4 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "霞谷 - 瞬移")
  if menu4 == nil then else
  if menu4[1] == true then l4() end
  if menu4[2] == true then L() end end
end


--霞谷先祖[下一个]
function l4()
	if gdCount4 == 0 and map11_in ~=1 then
		l41()
		gg.toast("重置先祖完成，1秒后瞬移至霞谷入口")
		gg.sleep(1000)
		Teleport({-2.916,2,7.53})
		gg.toast("已瞬移至 [霞谷入口] ，请手动进入")
		map11_in = 1
		return 0
    end

	if gdCount4 == 4 then
		gg.toast("请手动返回遇境")
	else
		gdCount4 = gdCount4 + 1
		if gdCount4 == 2 and map11_sky1_in ~=1 then
			l42()
			l43()
			Teleport({205.1636505127;56.70009994507;-601.97637939453})
			gg.toast("已瞬移至 [霞谷天空赛道一图入口] ，请手动进入后继续冲")
			gdCount4 = gdCount4 - 1
			map11_sky1_in = 1
			return 0
		end
		if gdCount4 == 4 and map11_sky1_out ~=1 then
			Teleport({206.68609619141;491.52456665039;-205.85830688477})
			gg.toast("已瞬移至 [霞谷天空赛道一图出口] ，请手动进入后继续冲")
			gdCount4 = gdCount4 - 1
			map11_sky1_out = 1
			return 0
		end
		if gdCount4 == 4 and map11_sky2_in ~=1 then
	    	l44()
			Teleport({149.81336975098;1008.25744628906;-100.43368530273})
			gg.toast("已瞬移至 [霞谷天空赛道二图入口] ，请手动进入后继续冲")
			gdCount4 = gdCount4 - 1
			map11_sky2_in = 1
			return 0
		end
		xyz = map11[1][gdCount4]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(3000)
		
		if gdCount4 ==1 then
			for i = 1, #xg1 do
				gg.sleep(3000)
				Teleport(xg1[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount4 ==2 then
			for i = 1, #xg2 do
				gg.sleep(1500)
				Teleport(xg2[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end

		if gdCount4 ==3 then
			gg.toast("这个真得自己来！")
		end
		
		if gdCount4 ==4 then
			for i = 1, #xg4 do
				gg.sleep(1500)
				Teleport(xg4[i])
			end
			gg.toast("这个先祖已结束，10秒后自动去终点！")
			gg.sleep(12000)
			Teleport({60.076934,137.721679,-294.028564})
			gg.sleep(4000)
			Teleport({9.378504,137.932312,-184.543090})
			gg.toast("请务必冥想谢谢！")
		end
		
	end
end


function l41()
	setClear("3307167098")
end

function l42()
	setClear("416637648")
end

function l43()
	setClear("3768849824")
end

function l44()
	setClear("2859830090")
end

--暮土
function symtxz()
  jiasu(2)
  menu5 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "暮土 - 瞬移")
  if menu5 == nil then else
  if menu5[1] == true then l5() end
  if menu5[2] == true then L() end end
end

local map12_in = 0
local map12_main1_out = 0 --一图出口
local map12_sunkenship_in = 0 --沉船入口
local map12_sunkenship_out = 0 --沉船出口
local map12_yilong_out = 0 --一龙图出口

--暮土先祖[下一个]
function l5()
	if gdCount5 ==0 and  map12_in ~= 1 then
		l51()
		l52()
		gg.toast("重置先祖完成，1秒后瞬移至墓土入口")
		gg.sleep(1000)
		Teleport({-6.42,2,4.445})
		gg.toast("瞬移完成，5秒后将瞬移至墓土一图入口")
		gg.sleep(5000)
		Teleport({-113.36,55,-796.6})
		gg.toast("瞬移完成")
		l51()
		l52()
		map12_in = 1
		return 0
	end
	
	if gdCount5 == 7 then
		gg.toast("请手动返回遇境")
	else
		gdCount5 = gdCount5 + 1
		if gdCount5 == 3 and map12_main1_out ~=1 then
			l53()
			l54()
			Teleport({-91.85065460205;11.72455883026;158.18051147461})
			gg.toast("已瞬移至 [暮土一图出口] ，请手动进入后继续冲")
			gdCount5 = gdCount5 - 1
			map12_main1_out = 1
			return 0
		end
		if gdCount5 == 5 and map12_sunkenship_in ~=1 then
			l55()
			jiasu(1)
			Teleport({189.26557922363;69.34118652344;-73.92557525635})
			gg.toast("已瞬移至 [暮土沉船入口] ，请手动进入后继续冲")
			gdCount5 = gdCount5 - 1
			map12_sunkenship_in = 1
			return 0
		end
		
		if gdCount5 == 6 and map12_sunkenship_out ~=1 then
			l56()
			Teleport({-343.83453369141;35.31271362305;386.27169799805})
			gg.toast("已瞬移至 [暮土沉船出口] ，请手动进入后继续冲")
			gdCount5 = gdCount5 - 1
			map12_sunkenship_out = 1
			return 0
		end
		
		if gdCount5 == 7 and map12_yilong_out ~=1 then
		  Teleport({-285.36907958984;92.04296112061;-400.69836425781})
		  gg.toast("已瞬移至 [暮土一龙图出口] ，请手动进入,6秒后将自动瞬移")
		  gg.sleep(6000)
		  Teleport({0.1838,206.55,2.58})
		  map12_yilong_out = 1
		  return 0
		end
		
		xyz = map12[1][gdCount5]
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(4000)
		
		if gdCount5 ==1 then
			for i = 1, #mt1 do
				gg.sleep(2500)
				Teleport(mt1[i])
			end
		end
		
		if gdCount5 ==2 then
			for i = 1, #mt2 do
				gg.sleep(3000)
				Teleport(mt2[i])
			end
		end
		
		if gdCount5 ==3 then
			for i = 1, #mt3 do
				gg.sleep(3000)
				Teleport(mt3[i])
			end
		end
		
		if gdCount5 ==4 then
			for i = 1, #mt4 do
				gg.sleep(3000)
				Teleport(mt4[i])
			end
		end
		
		if gdCount5 ==5 then
			for i = 1, #mt5 do
				gg.sleep(3000)
				Teleport(mt5[i])
			end
		end
		
		if gdCount5 ==6 then
			for i = 1, #mt6 do
				gg.sleep(3000)
				Teleport(mt6[i])
			end
		end
		gg.toast("这个先祖已结束，请点亮后继续冲！")
	end
end

function l51()
	setClear("3630339793")
end

function l52()
	setClear("1060292445")
end

function l53()
	setClear("2886532097")
end

function l54()
	setClear("4155738138")
end

function l55()
	setClear("1999438929")
end

function l56()
	setClear("2159324587")
end


--禁阁
function syjgxz()
  menu6 = gg.multiChoice({
    "1. 冲",
    "0. 返回主页"
  }, nil, "禁阁 - 瞬移")
  if menu6 == nil then else
  if menu6[1] == true then l6() end
  if menu6[2] == true then L() end end
end


local map13_top_in = 0
local map13_in = 0

--禁阁先祖[下一个]
function l6()
	if gdCount6 == 0 and map13_in ~=1 then
		l61()
		l62()
		l63()
		gg.toast("先祖重置完成，1秒后瞬移至禁阁入口")
		gg.sleep(1000)
		Teleport({-8.41,2,0.503})
		gg.toast("瞬移禁阁入口完成，请手动进入")
		map13_in = 1
		return 0
	end 
	
	if gdCount6 == 5 then
		gg.toast("没有下一个瞬移坐标了")
	else
	    gdCount6 = gdCount6 + 1
		xyz = map13[1][gdCount6]
		if gdCount6 == 4 and map13_top_in ~=1 then
			l64()
			Teleport({48.09609985352;228.29138183594;8.88393878937})
			gg.toast("请再冲一次")
			gdCount6 = gdCount6 - 1
			map13_top_in = 1
			return 0
		end
		Teleport(xyz)
		gg.toast("请手动点火4秒后将自动瞬移")
		jiasu(6)
		gg.sleep(4000)
		
		if gdCount6 ==1 then
			for i = 1, #jg1 do
				gg.sleep(1500)
				Teleport(jg1[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
	
		if gdCount6 ==2 then
			for i = 1, #jg2 do
				gg.sleep(3500)
				Teleport(jg2[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
	
		if gdCount6 ==3 then
			for i = 1, #jg3 do
				gg.sleep(2500)
				Teleport(jg3[i])
			end
			gg.toast("这个先祖已结束，请点亮后继续冲！")
		end
		
		if gdCount6 ==4 then
			for i = 1, #jg4 do
				gg.sleep(2500)
				Teleport(jg4[i])
			end
			--gg.toast("这个先祖已结束，30秒后自动去终点！")
			--gg.sleep(30000)
			--Teleport({-0.018859,310.305175,69.788833})
		end
		
	end
end

function l61()
	setClear("3594096657")
end

function l62()
	setClear("2041153668")
end

function l63()
	setClear("3576140497")
end

function l64()
	setClear("2797886853")
end


function setClear(num)
	gg.clearResults()
	gg.searchNumber(num, 32, false, gg.SING_EQUAL, 0, -1)
	gg.removeResults(gg.getResults(2))
	gg.getResults(10)
	gg.editAll("3811807379", gg.TYPE_QWORD)
	gg.clearResults()
end
